{"content":"[//]:# (!font urdu)\n\n<center>\n![Image1.png](https://images.hive.blog/500x0/https://files.peakd.com/file/peakd-hive/dlmmqb/AL35xBfs86Rms3sz6jnqLTacFsnhKWytPHHT9FHsuXs9vGX8pKBfHyJhnJgfRyN.png)\n</center>\n\n<center>[DALL·E 3](https://www.bing.com/images/create/a-poster-showing-a-bearded-24-year-old-man-buying-/1-665d8f44d5204f5b9fb678206f0ccd8f?id=RYy%2BrQD74EPRffi0k4VeaA%3D%3D&view=detailv2&idpp=genimg&noidpclose=1&thId=OIG3.P90p9JZYpkerO3WApWr_&FORM=SYDBIC&ssp=1&darkschemeovr=1&safesearch=moderate&setlang=en&cc=XL&PC=SANSAAND)</center>\n\n<center><img src=\"https://files.peakd.com/file/peakd-hive/dlmmqb/EogFA1Hz4uRAcpH41xpeWqqKkmF5vBZY6o6sHff8FNGU4huSiJWt79uAvVsiF4vdFoq.png\"></center>\n\n<div class=\"pull-left\"><br>\n\nI hope you all are doing well. As you know, I often share my various habits with you all. The reason behind this is that I want my friends to adopt the practices that I find beneficial for myself. Thus, I frequently write about my activities. Most of my activities are individual efforts aimed at helping others through self-initiative. You might recall my blog on cleanliness where I emphasized starting a cleanliness drive from within oneself. Today, I wish to write about a similar activity. Perhaps you will find this practice commendable and might adopt it yourselves. If someone else begins this task inspired by me, it will be an ongoing charity for me. Nothing would make me happier than leaving behind a legacy that continues to thrive even after I am gone.\n\n</div>\n\n<div class=\"pull-right\"><br>\n\nامید ہے آپ سب خیر خیریت سے ہوں گے. آپ جانتے ہی ہیں کہ میں اکثر اوقات اپنی مخلف عادات کے بارے میں آپ لوگوں سے باتیں شئیر کرتا رہتا ہوں. دراصل میں اپنے دوستوں کو اپنا ہم خیال بنانا چاہتا ہوں. میں چاہتا ہوں کہ جن عادات کو میں اپنے لیے اچھا سمجھتا ہوں، وہ عادات میرے دوستوں میں بھی منتقل ہوں. اس لیے وقتاً فوقتاً میں اپنی سرگرمیوں کے بارے میں لکھتا رہتا ہوں. میری زیادہ تر سرگرمیاں انفرادی سطح کی ہوتی ہیں، یعنی اپنی مدد آپ ہم کسی کو فائدہ پہنچائیں. آپ نے پہلے بھی پڑھا ہوگا جب میں نے صفائی کے اوپر بلاگ لکھی تھی تو اس میں بھی میرا نظریہ یہی تھا کہ ہم اپنی ذات سے صفائی مہم کا آغاز کریں. آج بھی اسی قسم کی ایک سرگرمی کے بارے میں لکھنا چاہ رہا ہوں. شاید میرے اس عمل کو آپ بھی اچھا سمجھیں اور خود بھی اس پر کاربند ہو جائیں. اگر میرے ذریعے سے یا مجھ سے انسپائر ہو کر کوئی اور بھی یہ کام شروع کر دے تو میرے لیے صدقہ جاریہ ہوگا. اس سے بڑھ کر میرے لیے خوشی کی بات اور کیا ہوگی کہ میں رہتی دنیا تک ایک ایسا پیغام چھوڑ کر جا رہا ہوں، جو میرے دنیا سے چلے جانے کے بعد بھی زندہ و تابندہ رہے گا. \n\n</div>\n\n<center><img src=\"https://files.peakd.com/file/peakd-hive/dlmmqb/Eo1vUZge74MJmaVnBfSNzzfB1sQwikXrTeAqt9SsvvKDUQmWMVUKeoJ3mgwDeYVvBcw.png\"></center>\n\n<center>\n![image2.png](https://images.hive.blog/400x0/https://files.peakd.com/file/peakd-hive/dlmmqb/AKRDN94pXzjDQ6LF6PiBLwbBZvneC5t5xSv7oyDZMkJbNQ4NcwwLWBVgxsPUfuj.png)\n</center>\n\n<center>[DALL·E 3](https://www.bing.com/images/create/a-picture-showing-a-boy-who-is-thinking2c-with-thou/1-665d9731f8ac45ac81f3f98b41a48cd2?id=cfnvuInLeypA65e80vJUzA%3D%3D&view=detailv2&idpp=genimg&noidpclose=1&thId=OIG3.O3WcW6E6UEoqusewHyjU&FORM=SYDBIC&ssp=1&darkschemeovr=1&safesearch=moderate&setlang=en&cc=XL&PC=SANSAAND)</center>\n\n<div class=\"pull-left\"><br>\n\n## My Habit\n\nNow, let me tell you about a habit of mine that I practice to the best of my ability and wish for all of you to adopt as well. This habit is celebrating Labor Day. You might be surprised because Labor Day is observed only on the 1st of May, so why am I calling it a habit? Your surprise is valid because a habit is something one repeatedly performs. But why I call celebrating Labor Day a habit will become clear by the end of this blog. Everyone knows that May 1st is observed worldwide to acknowledge the labor class, highlight their issues, and provide support and encouragement. Many conferences are held, various programs take place, and assistance and appreciation are extended to the laborers. However, I would like to question whether observing Labor Day just one day a year is enough? Certainly not. Laborers work every day, in the morning, evening, heat, and cold, and are always there to serve us. So why should we dedicate only one day to them? We should acknowledge them every day. Therefore, whenever I get the chance throughout the year, I celebrate Labor Day.\n\n</div>\n\n<div class=\"pull-right\"><br>\n\n**میری عادت**\n\nاب میں آپ کو بتاتا ہوں کہ وہ کون سی میری عادت ہے جس پر اپنی وسعت کے مطابق میں خود بھی عمل کرتا ہوں اور میں چاہتا ہوں کہ آپ سب لوگ بھی عمل کریں، وہ عادت ہے لیبر ڈے منانا. یقیناً آپ حیران ہوئے ہوں گے؟ کہ لیبر ڈے تو صرف یکم مئی کو ایک دن ہوتا ہے تو اسے میں عادت کیوں کہہ رہا ہوں؟ آپ کی حیرانگی بجا ہے کیونکہ عادت کہتے ہی اس عمل کو ہیں جو آپ بار بار سرانجام دیتے رہتے ہیں. لیکن میں لیبر ڈے منانے کو اپنی عادت کیوں کہہ رہا ہوں، یہ آپ بلاگ کے آخر میں سمجھ جائیں گے. لیبر ڈے کے بارے میں تو سبھی جانتے ہیں کہ یکم مئی کے دن عالمی سطح پر مزدور طبقہ کا احساس کرنے کے لیے، ان کے مسائل کو اجاگر کرنے کے لیے اور ان کی امداد و حوصلہ افزائی کے لیے انفرادی و اجتماعی طور پر لیبر ڈے منایا جاتا ہے. اس دن بہت سی کانفرنسیں منعقد ہوتی ہیں. بہت سے پروگرامز ہوتے ہیں. غریبوں کی امداد بھی کی جاتی ہے. محنت کشوں کی حوصلہ افزائی کی جاتی ہے اور مزدور طبقہ کو خراج تحسین پیش کیا جاتا ہے. لیکن یہاں پر میں یہ سوال کرنا چاہوں گا کہ کیا ایک دن لیبر ڈے منا لینا پورے سال کے لیے کافی ہو جاتا ہے؟ ہرگز نہیں. مزدور تو روزانہ ہی کام کرتے ہیں. صبح، شام، گرمی، سردی ہر موسم اور موقع پر وہ ہمارے کام آتے ہیں تو ہم صرف ایک ہی دن کیوں ان کے لیے خاص کریں؟ ہمیں تو روزانہ ان کا احساس کرتے رہنا چاہیے. اس لیے میں پورا سال جب موقع ملتا ہے، لیبر ڈے ضرور مناتا ہوں. \n\n</div>\n\n<center><img src=\"https://files.peakd.com/file/peakd-hive/dlmmqb/Eo1vUZge74MJmaVnBfSNzzfB1sQwikXrTeAqt9SsvvKDUQmWMVUKeoJ3mgwDeYVvBcw.png\"></center>\n\n<center>![image3.png](https://images.hive.blog/400x0/https://files.peakd.com/file/peakd-hive/dlmmqb/AKqb9pwxzPcSwTqei73oV8gT7Nad8GdimJ15Zfxer7XAhxbQH1LsJSHQPnDQ5Ey.png)</center>\n\n<center>[DALL·E 3](https://www.bing.com/images/create/a-picture-showing-a-boy-giving-beverages-like-a-gl/1-665d927d6afe4266a5222e8175edef11?id=NI5G52ZTiajELyjbYj3H2g%3D%3D&view=detailv2&idpp=genimg&noidpclose=1&thId=OIG3.SwLl2kx65leHH0QAFvpV&FORM=SYDBIC&ssp=1&darkschemeovr=1&safesearch=moderate&setlang=en&cc=XL&PC=SANSAAND)</center>\n\n<div class=\"pull-left\"><br>\n\n## My Labor Day\n\nMay is the peak month of summer in Pakistan. In Karachi, where I live, it remains hot throughout the year. December, January, and February have relatively bearable weather, which we call winter. From March and April, the heat gradually intensifies, reaching its peak in May and continuing through June and July. As these days are scorching hot, imagine how difficult it must be for laborers to work in such heat. Whenever I go out during these hot days, or when I used to return from university, or any other time when I see laborers, I try to help them. As you might have gathered from my previous blog about the downsides of giving money to beggars, I am not in favor of giving cash. Instead, I prefer to provide food items or other useful goods. Because even if you give money with the intention of helping, it still feels like charity. This is my personal belief, and you may disagree.\n\n</div>\n\n<div class=\"pull-right\"><br>\n\n**میرا لیبر ڈے**\n\nمئی کا مہینہ پاکستان میں گرمیوں کے عروج کا مہینہ ہوتا ہے. میں جس شہر میں رہتا ہوں یعنی کراچی، یہاں تو سال کے 12 مہینے گرمی ہی رہتی ہے. البتہ دسمبر، جنوری فروری میں کچھ گزارے لائق موسم ہو جاتا ہے، جسے ہم سردی کہہ سکتے ہیں. پھر مارچ، اپریل میں گرمی آہستہ آہستہ بڑھتی چلی جاتی ہے. مئی کے مہینے میں گرمی اپنے عروج پر پہنچ چکی ہوتی ہے. اور پھر یہ گرمی جون جولائی تک اسی طرح اپنی پوری آب و تاب کے ساتھ موجود رہتی ہے. جیسا کہ ان دنوں بھی بہت گرمی ہے. آپ سوچیں مئی کے مہینے میں جب چلچلاتی اور سخت دھوپ میں ایک عام آدمی بھی قریبی دکان پر سودا لینے جائے تو پسینے میں شرابور ہو کر واپس آتا ہے. اس موسم میں اگر کوئی مزدور مزدوری کرے تو اس کی کیا حالت زار ہوگی. جب بھی ان گرمی کے دنوں میں، میں کسی کام سے باہر جاتا ہوں، یا جب میں یونیورسٹی سے واپس آیا کرتا تھا، یا کسی بھی اور موقع پر جہاں مجھے محنت کش نظر آتے ہیں تو میں ان کی مدد کرنے کی کوشش کرتا ہوں. میں نے بھیک کے نقصانات پر جو بلاگ لکھی تھی، اس سے آپ کو یہ اندازہ تو ہو چکا ہوگا کہ میں فقیروں کو پیسے دینے کے حق میں تو بالکل بھی نہیں ہوں اور امداد میں پیسے دینے کے بجائے اشیائے خورد و نوش یا دیگر استعمال کی چیزیں دینا مجھے زیادہ بہتر لگتا ہے. کیونکہ پیسے آپ اگر مدد کی نیت سے دیتے ہیں تب بھی اس میں بھیک کا سا شائبہ رہتا ہے. بہرحال یہ میرا اپنا ذاتی خیال ہے. آپ اس سے اختلاف کر سکتے ہیں. \n\n</div>\n\n<center><img src=\"https://files.peakd.com/file/peakd-hive/dlmmqb/Eo1vUZge74MJmaVnBfSNzzfB1sQwikXrTeAqt9SsvvKDUQmWMVUKeoJ3mgwDeYVvBcw.png\"></center>\n\n<center>![image4.png](https://images.hive.blog/400x0/https://files.peakd.com/file/peakd-hive/dlmmqb/AKVXjMuiGuvZLCa1QxvvotM8phcuQtxVjF7na7doRTW5asYdyUapVogj999X3yA.png)</center>\n\n<center>[DALL·E 3](https://www.bing.com/images/create/a-picture-showing-laborers-working-in-various-occu/1-665d91823e71403fa1c458b1d850d0cf?id=gl%2FQywhzwk0z1J8Qu75QfA%3D%3D&view=detailv2&idpp=genimg&noidpclose=1&thId=OIG3.uQITtlavjsntquYQrIAg&FORM=SYDBIC&ssp=1&darkschemeovr=1&safesearch=moderate&setlang=en&cc=XL&PC=SANSAAND)</center>\n\n<div class=\"pull-left\"><br>\n\n## Celebrating Labor Day\n\nFor me, any day I see a laborer is Labor Day, and I celebrate it. On May 1st specifically, and generally throughout the year, I gift various items to laborers during their work. On May 1st, I leave home and buy water, juice bottles, Jam-e-Shirin (a popular red syrup in Pakistan), fruits, biscuits, chips, sweets, and particularly items that provide relief from the heat. Then I go out to celebrate Labor Day. Whenever I see a laborer working in the scorching sun, I gift them these items. They gladly accept them. Fortunately, most laborers in our country do not beg. Once, when I tried to give food items to a vegetable seller as assistance, he refused, saying he was here to earn a respectable living and despised taking free items. Before I could explain, he sent me away, so I decided to buy vegetables from him instead. I didn't haggle over the price, paid him respectfully, and also managed to give him a gift.\n\n</div>\n\n<div class=\"pull-right\"><br>\n\n**لیبر ڈے سیلیبریشن**\n\nیوں تو میرے لیے لیبر ڈے سال کا ہر وہ دن ہوتا ہے جس دن مجھے کہیں کوئی مزدور نظر آجائے. میں اسے اپنے لیے لیبر ڈے سمجھتا ہوں اور اسے مناتا ہوں. یکم مئی کو خصوصی طور پر اور باقی سال عمومی طور پر میں محنت کشوں کو ان کے کام کے دوران مختلف قسم کی چیزیں ہدیہ کرتا ہوں. یکم مئی کو میں گھر سے نکلتا ہوں. مزدوروں کے عالمی دن پر سبھی کی چھٹی ہوتی ہے سوائے مزدوروں کے. اس لیے آپ کو یہ فکر بالکل نہیں ہوتی کہ مزدور آج نہیں ملیں گے. آپ کسی بھی جگہ چلے جائیں. لیبر کام کر رہے ہوتے ہیں. میں سب سے پہلے سپر مارکیٹ سے جا کر پانی، جوس کی بوتلیں، جام شیریں (جو پاکستان میں مشہور سرخ رنگ کا شربت ہوتا ہے)، پھل، بسکٹ، چپس، میٹھی چیزیں، خصوصاً گرمی میں ٹھنڈ پہنچانے والی چیزیں وغیرہ خریدتا ہوں. اور پھر لیبر ڈے منانے نکل جاتا ہوں. جہاں کہیں کوئی مزدور پسینے میں شرابور کام کرتا دکھائی دیتا ہے تو اسے مختلف قسم کی کھانے پینے کی اشیاء گفٹ کرتا ہوں. وہ اسے بخوشی قبول بھی کر لیتے ہیں. خوش قسمتی کے ساتھ ہمارے ملک کا اکثر مزدور طبقہ بھیک نہیں لیتا. میں نے ایک سبزی فروش کو جب امداد کے طور پر کھانے پینے کی چیزیں دینا چاہیں تو اس کے صاف انکار کر دیا. اس کا یہ کہنا تھا کہ وہ یہاں عزت کے ساتھ حلال رزق کمانے آیا ہے. اسے مفت چیزیں لینے سے نفرت ہے. اس سے پہلے کہ میں اسے سمجھاتا، اس نے مجھے وہاں سے چلتا کیا. بالآخر میں نے اس سے سبزی خریدنے میں ہی عافیت جانی. ہاں البتہ میں نے سبزی کی قیمت میں کمی نہیں کروائی. اسے باعزت طریقے سے پیسے مل گئے اور مجھے سبزی. میں نے بھی ہار نہیں مانی، اسے گفٹ دے کر ہی آیا. \n\n</div>\n\n<center><img src=\"https://files.peakd.com/file/peakd-hive/dlmmqb/Eo1vUZge74MJmaVnBfSNzzfB1sQwikXrTeAqt9SsvvKDUQmWMVUKeoJ3mgwDeYVvBcw.png\"></center>\n\n<center>![image5.png](https://images.hive.blog/400x0/https://files.peakd.com/file/peakd-hive/dlmmqb/AKtSwAnKD1pET7YUtaBXrNTBzoLeMZNhP66ukKaqT6kPcDTzpJYhJPfdyUPn1Xb.png)</center>\n\n<center>[DALL·E 3](https://www.bing.com/images/create/a-picture-showing-a-boy-giving-beverages-to-ricksh/1-665d9204739e4bc1aed68b6cb3c13b9a?id=%2FjUJwkasv2%2FYfQQxb3lSlA%3D%3D&view=detailv2&idpp=genimg&noidpclose=1&thId=OIG4.IKug2dqyjjqE8wbm3gPI&FORM=SYDBIC&ssp=1&darkschemeovr=1&safesearch=moderate&setlang=en&cc=XL&PC=SANSAAND)</center>\n\n<div class=\"pull-left\"><br>\n\n## Facing Criticism\n\nEvery good deed you initiate will garner both praise and criticism. Some people will mock you and try to discourage you. I mentioned in my cleanliness blog how my school and university fellows mocked me. Similarly, when I started this practice, I received many negative comments. I used to leave university around 2 PM and saw rickshaw drivers and other transport workers waiting for passengers in the sweltering afternoon. I thought of arranging cold drinks for them. So, I started bringing a bottle of Jam-e-Shirin with me in the morning, adding ice after university, and offering it to them. While many appreciated and blessed me, some gave all sorts of advice. Someone suggested setting up coolers, others questioned why I was serving drinks myself. Though I've seen coolers on Karachi's streets where thousands quench their thirst, I don't have the resources for such large-scale work. I do what I can within my means, and therefore, I continued my practice despite strange questions and unsolicited advice.\n\n</div>\n\n<div class=\"pull-right\"><br>\n\n**تنقید کی زد میں**\n\nہر نیک کام کی ابتداء میں آپ کو لوگوں کی جانب سے جہاں تحسین و آفرین ملتی ہے وہیں پر کچھ ایسے لوگ بھی ضرور ہوتے ہیں جو آپ کے کام پر تنقید کرتے ہیں. آپ کا مذاق اڑاتے ہیں اور آپ کی ہمت توڑنے کی کوشش کرتے ہیں. میں نے صفائی والے بلاگ بھی ذکر کیا تھا کہ کیسے اپنے ہی سکول فیلوز اور کالج و یونیورسٹی فیلوز میرا مذاق اڑاتے رہے تھے. بالکل، اسی طرح میں نے جب یہ رسم شروع کی تب بھی ایسے منفی تبصرہ جات سننے کو ملا کرتے تھے. میں یونیورسٹی سے واپسی پر چھٹی کے وقت 2 بجے کے قریب نکلتا تھا، تو سڑک پر رکشہ ڈرائیورز، پک اینڈ ڈراپ والے اکثر لوگ تپتی دوپہر میں سواریوں کے منتظر ہوتے تھے. میں نے سوچا کہ یہ لوگ بے چارے اتنی گرمی میں کھڑے ہیں. چلو ان کے لیے ٹھنڈے پانی اور شربت کا انتظام کر لیا جائے سو میں روز صبح گھر سے آتے وقت جام شیریں کی ایک بوتل لے آیا کرتا. یونیورسٹی کے بعد اس میں برف ڈال کر سب رکشہ ڈرائیورز، بس والوں اور گاڑی والوں کو پلایا کرتا تھا. میرے اس عمل کو دیکھ کر جہاں بہت سے لوگوں سے دعاؤں سے نوازا وہیں کچھ لوگ طرح طرح کے مشورے دینے لگے. کوئی کہتا کولر لگوا دو. کوئی کہتا ہاتھ سے کیوں پلا رہے؟ کوئی کیا مشورہ دیتا تو کوئی کیا. میں نے دیکھا ہے کئی جگہوں پر کراچی کی شاہراہوں پر ٹھنڈے پانی کے کولر رکھے ہوتے ہیں. جہاں سے دن بھر میں ہزاروں لوگ پانی پی کر اپنی پیاس بجھاتے ہیں. لیکن میرے پاس اتنا سرمایہ نہیں ہے کہ میں اتنے بڑے پیمانے پر کام کر سکوں. میری جتنی حیثیت ہے، میں اسی کے مطابق کرنء کی کوشش کرتا ہوں. لہٰذا میں نے ہمیشہ کی طرح ان عجیب و غریب سوالات اور مشوروں کی پرواہ کیے بغیر اپنی یہ عادت جاری رکھی.\n\n</div>\n\n<center><img src=\"https://files.peakd.com/file/peakd-hive/dlmmqb/Eo1vUZge74MJmaVnBfSNzzfB1sQwikXrTeAqt9SsvvKDUQmWMVUKeoJ3mgwDeYVvBcw.png\"></center>\n\n<center>![image6.png](https://images.hive.blog/400x0/https://files.peakd.com/file/peakd-hive/dlmmqb/AK9QY4F88Yc2PbyeWqN8NgnfnLsFVapYyTR3cWYR6ZAZ2owZduChntveMPgqc2C.png)</center>\n\n<center>[DALL·E 3](https://www.bing.com/images/create/a-picture-of-a-boy-feeling-relaxed-and-happy-after/1-665d9370da2c4db19aa1001d7af75984?id=aflM9xzKKUjjWOrvy%2Bwb8Q%3D%3D&view=detailv2&idpp=genimg&noidpclose=1&thId=OIG3.wTYOTsmkQm0QF8Ue8Soo&FORM=SYDBIC&ssp=1&darkschemeovr=1&safesearch=moderate&setlang=en&cc=XL&PC=SANSAAND)</center>\n\n<div class=\"pull-left\"><br>\n\n## Lessons Learned\n\nWhen I offer water to a thirsty person, I earn rewards and experience an indescribable joy that soothes my own heart. I imagine how happy I would be if I were feeling hot and someone offered me cold water. I want to bring that same happiness to others. The peace and satisfaction I get from giving water to others is something I can't put into words. Try it yourself. Once, muster the courage to take this step. You will experience such tranquility that you will want to perform this good deed daily. Along with earning rewards, you will find inner peace. What more could you want? Now that it's summer, take advantage of this opportunity. Help people, quench their thirst, earn good deeds, stay happy, and spread joy.\n\n</div>\n\n<div class=\"pull-right\"><br>\n\n**درس آموز**\n\nجب میں کسی پیاسے شخص کو پانی پیش کرتا ہوں، تو مجھے انعامات ملتے ہیں اور ایک ناقابل بیان خوشی کا تجربہ ہوتا ہے جو میرے اپنے دل کو سکون پہنچاتی ہے۔ میں تصور کرتا ہوں کہ میں کتنا خوش ہوتا اگر مجھے گرمی لگ رہی ہوتی اور کوئی مجھے ٹھنڈا پانی پیش کرتا۔ میں وہی خوشی دوسروں کو دینا چاہتا ہوں۔ دوسروں کو پانی دینے سے جو سکون اور اطمینان حاصل ہوتا ہے، وہ بیان سے باہر ہے۔ آپ بھی کوشش کریں۔ ایک بار، اس قدم کو اٹھانے کی ہمت کریں۔ آپ کو ایسا سکون ملے گا کہ آپ روزانہ اس نیک عمل کو انجام دینے کی خواہش کریں گے۔ انعامات حاصل کرنے کے ساتھ، آپ کو اندرونی سکون ملے گا۔ آپ کو اور کیا چاہیے؟ اب جب کہ گرمی کا موسم ہے، اس موقع سے فائدہ اٹھائیں۔ لوگوں کی مدد کریں، ان کی پیاس بجھائیں، نیکیاں کمائیں، خوش رہیں، اور خوشی پھیلائیں۔\n\n</div>\n\n<center><img src=\"https://files.peakd.com/file/peakd-hive/dlmmqb/Eo1vUZge74MJmaVnBfSNzzfB1sQwikXrTeAqt9SsvvKDUQmWMVUKeoJ3mgwDeYVvBcw.png\"></center>\n\nJoin Binance through [THIS LINK](https://accounts.binance.me/en/register?ref=Y08YZSY6) for 10% off trading fees! Let's save together!\n\nٹریڈنگ فیس میں 10% چھوٹ کے لیے [اس لنک]((https://accounts.binance.me/en/register?ref=Y08YZSY6)) کے ذریعے بائننس میں شامل ہوں! آئیے مل کر بچائیں!\n</center>\n\n<center><img src=\"https://files.peakd.com/file/peakd-hive/dlmmqb/Eo1vUZge74MJmaVnBfSNzzfB1sQwikXrTeAqt9SsvvKDUQmWMVUKeoJ3mgwDeYVvBcw.png\"></center>"}