{"content":"There is a butcher here in Krabi that is a dog-lover and found out about us.  While he doesn't have enough money to contribute to our cause he was very kind to volunteer to give us a bunch of bones once a month.  He could sell these bones to make a bit of money because people will pay a few cents for a bone in order to put it in a broth of some sort but instead he choses to give them to us for free!   They are greatly appreciated by all of our furry pals that call the Tiger Cave Temple home.  \n\n\n<center> \n![image.png](https://cdn.steemitimages.com/DQmeCRC3bVahcBGc3qqhdZHVeZP2Upw6M3Qm8WSraVsFK4F/image.png)\n</center>\n\nHow perfect and lucky is that photo timing?  This little pup is one of the only youngins at the temple at the moment and this is a good thing.  There are already over 100 dogs at the temple and the last thing we need is another round of puppies.  Thankfully, all of the female dogs at the temple are sterilized and there hasn't been many midnight dropoffs of unwanted pets either.  At least for now, we seem to have the pupulation under control.\n\n<center> \n![image.png](https://cdn.steemitimages.com/DQmPeyCbntiSjnoaoxGzQxNrhF3emhipCGQJVN1xM985AxY/image.png)\n</center>\n\nBack to the bones and a little bit of information that someone out there might find helpful.   \n\nI know these dogs at the temple quite well and they are very familiar with me and know that I mean them no harm.  In fact, they really look forward to my arrival because I always come bearing food gifts of some sort.   Even though that is the case I **always leave dogs alone when they are munching on a bone.**   Even though these dogs know me, messing about with a dog when it is chewing on something like a bone is a fantastic way to end up getting bit.  \n\n<center> \n![image.png](https://cdn.steemitimages.com/DQma3tJAfCYpkCYN5YFFomoAXiCkEdBb941wFD4ZANyf2Va/image.png)\n</center>\n\nThis is why most of my pictures of dogs chewing on the bones that I just gave to them are taken from a distance.  You probably know the old expression \"let sleeping dogs lie\" but I think \"leave dogs chewing on bones alone\" is an even more important one to keep in mind.\n\n<center> \n![image.png](https://cdn.steemitimages.com/DQmWJFnH2XdXdxGLt5pVYJXY1yPzGk6r7JWQVHFM8NZwSaJ/image.png)\n</center>\n\nI like these dogs and they like me.  They do not see me as a threat.  However, almost all dogs and especially dogs that grew up in a semi-hostile environment like living the street can be extremely protective when it comes to food.   When I distribute the bones these dogs that spend all day hanging out with one another will take the bone far away from the other dogs to chew away in solitude.   \n\n<center> \n![image.png](https://cdn.steemitimages.com/DQmQzFmC3985yjV83p3SsWj45NcW5YGmq2hvuj6vRxFD7uL/image.png)\n</center>\n\nI've always found this trait of dogs to be quite humorous and it doesn't really matter what sort of environment the dog grew up in, it is just a trait that most dogs seem to have built into their DNA.   Even my 3 dogs at home, who have never had to work for a meal in their lives nor have they had food taken away from them in years outside of very rare instances, will still wander off to a corner of the yard or in my house where they are away from the others as well as me when they are working on a chewy snack.   \n\n<center> \n![image.png](https://cdn.steemitimages.com/DQmUqJmFfMRe5gx5gc8iYTUTL1AbpE72qGwaatuFXhuFyCo/image.png)\n</center>\n\nThe doggos really enjoyed this special treat today and every time that I come with them.  Some folks out there state that giving bones to dogs is a bad idea but there are a couple of reasons why these bones are ok for these guys.  The bones I give them are very large and are not the kind that will splinter like chicken bones will.  Also, these dogs are not a couch-sleeping Pomeranian.   These dogs grew up eating whatever they could find and are very adept and not hurting themselves when eating.   It's good to exercise caution with any dogs that grew up in a more contained environment though.  I wouldn't give bones to my dogs at home because they didn't grow up in the wild.   They just aren't as dangerous as the old wives tale would have you believe.  \n\nA cursory health check was done on the 2 dozen or so dogs that greeted me at the entrance and everyone seems to be in tip-top shape and the monks reported no injuries, illness, or new additions to the pack so that my friends, is what we and Krabi Animal Welfare call a win!  \n\n<hr> \n\nif you would like to see how you can help out or simply spread the word, please visit our website at\n\n<h3> http://krabianimalwelfare.org </h3>\n\n<center> ![21462758_174743779763179_4154543215066704521_n.jpg](https://cdn.steemitimages.com/DQmXHEhXj4e6AzsbAJKsFo8csozuoq1uUcMSdFQTYifzi55/21462758_174743779763179_4154543215066704521_n.jpg) </center> \n\n<center> <sub> Krabi Animal Welfare is a charity run entirely by volunteers and are a registered non-profit organization in Thailand and the U.K..  We aim to relieve the pain and suffering of dogs and cats within Krabi Province. </sub> \n\n เป็นผู้สนับสนุนรายเดือนหรือบริจาคครั้งเดียวได้ที่:\n\nhttp://krabianimalwelfare.org</center>  \n\n<hr>\n\n<hr>"}