{"content":"#### Hive-Reachout Community>>||The Healing Power of Love (InLeo Initiative)\n\n![vd315q.jpg](https://files.peakd.com/file/peakd-hive/hive-reachout/23xypFbYDuK71qncBL8xV2nu1MG2Lz4pqGhF6vQuq2xCLSsagK4HnxCAYoxfjTpN1ky4F.jpg)\n\n\n____ \n## <center>**WELCOME TO HIVE-REACHOUT COMMUNITY**</center> \n\n<center><sub>***A community open to advertise and promote Hive Blockchain through sharing love and support to humanity..***</sub></center>\n____ \n\n\n\n\n**Do well to subscribe to our community as we put heads together to promote humanity and love..**\n\n\n![5wn4VDmRceY4POFaqi.gif](https://files.peakd.com/file/peakd-hive/ovey10/23ydCbjvpv4mP45XPQwEU1T6WViV8sSnAzVQ5uypviUyqkLEP5dZqmv4TUcPnd745UYXq.gif)\n\n\n\n<center><sub>**[Click here to be re-directed to Hive Reachout Community](https://InLeo.io/c/hive-178437)**</sub></center>\n\n____\n### <center>**The Healing Power of Love (InLeo Initiative)**</center>\n____\n\nhttps://img.inleo.io/DQmUX2cV6WQsUnwrr3YJxQ1U273YpFfFanL729128TZiuX6/Copy%20of%20Copy%20of%20Copy%20of%20Week%2032_20240622_105709_0000.png\n\n<div class=\"text-justify\"> \n\nWe are pleased to announce our recent Collab with the InLeo team to promote knowledge of Hive and the InLeo user interphase amongst our community members.\n\nWe will be teaching members of the community about InLeo frontend and possibly engage them in activities that will improve their knowledge about Hive and InLeo as part of the Hive Reachout collaboration with InLeo.\n\nThis week, the Hive Reachout and her community members will be sharing points and ideas on the topic <h5>**\"The Healing Power of Love\".**</h5> \n\nIt is our desire to provide a conducive environment of learning to all the newbies we are onboarding, and all other newbie on Hive. \n\nThe Hive Reachout and InLeo initiative will help newbies and other community members to learn more about InLeo frontend and other necessary factors about InLeo.</div>\n\n\n\n<div class=\"text-justify\"> \n\nhttps://img.inleo.io/DQmUyK3kcxxQpPHJcwLgoy8f9P2gHeZHRnnnY81BdJ37Kob/IMG-20240611-WA0033.jpg\n\n\n____\n### <center>**How To Login Your Hive Account Via InLeo Frontend**</center>\n____\n\n\nInLeo is a micro-blogging space set up by @leofinance community on Hive Blockchain, where you can make threads and publish your posts. You earn both in Hive and $Leo (A native token of the community) in the process.\n\ni. Click on the cite link <a href='InLeo.io'>InLeo.io</a>\n\nhttps://img.inleo.io/DQmNuJ1G1qMP2PmsEn2TjGM23RJHz6YKRacnty4uAXm8TYZ/Screenshot_20240610-150717.jpg\n\nii. You can sign in with X (Twitter) only if you registered your hive account using your Twitter X via the InLeo frontend or You may choose to sign in through your google account if you did register using your google account.\n\niii. The most common way of signing in for users that registered their Hive accounts via other frontends other than InLeo is through LeoAuth, Hivesigner and Hive Keychain.\n\nYou may choose to sign in via LeoAuth. with your Hive username and your Hive private key (The keys assigned to you when you registered your account).\n\niv. You can sign in with your Hive Keychain. \n\nhttps://img.inleo.io/DQmcB8NDYp93AM1xTyL1BAUVcB42VE8oK4QJut3qhD4HfAL/Screenshot_20240610-185637.jpg\n\nThis method is best used when you have your Hive keychain app installed in your mobile device if not,\n\n\nvi. You can use the hive signer method to login InLeo with just your username and your private key.\n\nhttps://img.inleo.io/DQmdZ2DuFru8ZHNDENUUmJ1tgaVaTQW4aDhxdTcLi3S2Mph/IMG-20240610-WA0019.jpg\n\n**If you can see your profile icon like this, it means you have successfully logged into InLeo**\n\n____\n### <center>**How To Publish Post/Threads Via InLeo Frontend..**</center>\n____\n\n\nhttps://img.inleo.io/DQmfTDuHqkPs4yXG5cLkfhCEHsHhQXrngCReadgPd68iW9p/IMG-20240611-WA0021.jpg\n\ni. Click on the pencil icon on the left side of your screen indicated with an arrow and select 'create a post'\n\nNote: For those using mobile the pencil icon is by the right below your screen.\n\n \nhttps://img.inleo.io/DQmTCKXKDZSLkkMguBewNQkASDCbmoNkJ7H9C3ZkurPHpvL/IMG-20240611-WA0031.jpg\n\nii. The \"Create a Post\" interphase on InLeo will appear like the one above..\n\nThe number 1 is the box to input the Title of your post while number 2 is for the body of your post or article.\n\nThe green arrow is pointing at the gallery icon where you can input your desired image..\n\nhttps://img.inleo.io/DQmYU71ATpMPFPU1gYE5Fea224c9sy5ysayXT7cWVfvW2oD/IMG-20240611-WA0029.jpg\n \niii. After preparing your post and inserting your desired pictures or thumbnail, you can use the number one section (Select Community) on the image above to choose the preferred community you want to publish your post in. \n\n*since this program is for the InLeo Collab with Hive Reachout community, all post should be made into the **Hive Reachout community**..\n\n\niv. The tag box indicated as number 2 is meant to input the keywords or how you label your post.\n\n*For this initiative, we shall be using; hive-reachout, love, inleo and any other preferred tags..*\n\n*Note: Press your enter key after each tag on InLeo, so that your tags can count separately...*\n\nhttps://img.inleo.io/DQmPuAXuxjvLQJBB4g6kgd16D3DZnmFwRwfHEVRkeqrpBoK/IMG-20240611-WA0030.jpg\n\nv. For newbies, we advice to live the reward at 50% Hive power and 50% HBD but you can go ahead to change it if you wish.\n\n- You can allocate portion of your rewards to another account via the beneficiary side and you can as well neglect it if you want to claim all rewards of your post outcome..\n- Scheduling your post means your post will not be published immediately until the desired time you will choose in the post schedule side.. If you don't want to reschedule your post for another time before publishing, neglect the post scheduling and move straight to Publish your post..\n- The arrow on the image above is pointing at the publish icon, you can click on it when you are done and ready to take up your post..\n\n### **Rules For This Initiative**\n-  **DON'T PLAGIARIZE!!**\n- Create your posts in the Hive Reachout community.\n- Tag two or three person to join the hive-reachout/InLeo Collab.\n- Use the tag #hive-reachout #love and any other tags of your choice..\n- Engage in (at least) two posts in the community: \n- Your words count should be minimum of 500 words..\n- Original pictures are \"encouraged\", however if you want to use pictures that are not yours, use free sites like <a href='https://pixabay.com/'>pixabay.com</a>, <a href='https://www.pexels.com/'>pexels.com</a>\n- Cite external materials properly.\n- Drop your InLeo post link in the comment section below...\n\n\n**We will be tagging our newbies in the comment section below and should incase you find this article important to someone probably a newbie, endeavor to tag them in the comment section..\nWe hope to ease the work for onboarders on Hive Blockchain..**\n\n\n____\n\n## <center>**YOU CAN REACH US VIA OUR SOCIAL MEDIA HANDLES**</center>\n____\n\nWe are set to reach large number of audiences in this mission via the following handles: </div>\n\n![FUkUE5bzkAZT3HzV5tJDiU2ik81PCd4JCyhWnRcDN8XJsVFY3UNB8DCZkTaR7u9FShbSRL9TgeKjSyg6jEUohbdFwqoRvbDF5M3eoVV338ALkLbp3Yb1NyVbn6FwDnYiU84aC9ecQPwsywChghPJ3woAHGnAeZAUyNq4.png](https://files.peakd.com/file/peakd-hive/ovey10/23zbgTz1A24uGRLzYf64hB2moefM6sMuJKL8zvEwa2wmaZzvspydzg4rmzUjgpcfwNSqg.png)\n\n* You can connect with us on Twitter(X) via:\n**<a href='https://twitter.com/Hive_Reachout?t=Fidz77sEcdHQ-_dbgpLxSw&s=09'>@Hive_Reachout On Twitter X</a>**\n\n* You can connect us on Instagram via:\n**<a href='https://www.instagram.com/hive_reachout?igsh=OGQ5ZDc2ODk2ZA=='>@Hive_Reachout On Instagram</a>**\n\n* Reach us via our email address\n**Hivereachout@gmail.com**\n\n* Or  <a href='https://discord.com/invite/N2Pj9Ekccu'>Via Discord</a>\n\n#### Endeavor to subscribe and give us a follow..\n\n<div class=\"text-justify\"> \n\n\n## <center>***APPRECIATION***</center>\n\n____\n\nWe are indeed grateful to everyone, contributing through words, encouragement and donations to push this community forward. The Hive-reachout team are saying a big thank you 🙏🙏\n\n\n\n____\n\n\n<center>***Let's Spread love, calmness, and smiles on people's faces by reaching out to them...***</center>\n\n\n![1706797841882 (2).png](https://files.peakd.com/file/peakd-hive/ovey10/23xVcQWuGkHjf5GDdmV7iQSNFbkiwVnk8m7Vzuan5USHEuE7YQChSgyhbr2GqreKGQXxm.png)\n\n\n____\n### <center>**If you love this project do well to comment, reblog, upvote,  tag one or two friends and support us in any way that you can🙏🙏**</center>\n____\n\n\n![BackgroundEraser_20240201_123513386 (1).png](https://files.peakd.com/file/peakd-hive/ovey10/23uFKWrJGynFvorYadCQhBgC9A29D8CyGi7wd8fsDepwx1FWnx6cZWSFhPHUB79rFAYuk.png)\n\n</div>\n\n\n**Post Written by @ovey10**\n\n\nPosted Using [InLeo Alpha](https://inleo.io/@hive-reachout/hivereachout-communitythe-healing-power-of-love-inleo-initiative1-92i)"}