[
  {
    "author": "inibless",
    "permlink": "hive-reachout-putting-smiling-on-children-faces-by-giving-writing-materials-fed",
    "body": "It cost nothing to live a value added life by adding smile on people's faces. There's many things we trashed out while thousands are looking for daily survival. Thank God for [**Hive Reachout Community**](https://peakd.com/c/hive-178437/created) that  came out with a project set to expressed love and compassion for humanity through charity giving  while promoting hive Blockchain. \n https://img.inleo.io/DQmU2PzvkNFjJUNUL6LzesjrVH5bZ8uEfsxpwA9PWSJ26SZ/IMG_20240715_111126_165.jpg \n\nToday, seems to be my happiest day after spending some moments with children in the school, I always thought of how to impact my society positively, but I came to discover that, to impact the world is by starting from your immediate environment and this is possible by living a value added life, doing that small thing puts smile on your neighbor's face. \n https://img.inleo.io/DQmSNZ9GBGqLdtsTxM9V5cERv2yf2oq2QWSA15pDepXd7K4/IMG_20240715_111000_567.jpg \n\nMeanwhile, I was excited after the first response I got from the school management to share some of my time with Upper grade one students, I'm a certified teacher, I have so much passion for teaching; I enjoyed children's company more than any other things, I was just smiling as I shared with them about on why they should take their studies seriously as the world is hoping on the younger generation, initially, I was scared because I thought they won't give me their attention but I was surprised as I began to asked them some interesting questions and the response they gave me, shows that they really love my coming. \n https://img.inleo.io/DQmRnMBTTWsncqA4su49MzrkFKQJQbdxZRLVYLssmBgsRbg/IMG_20240715_110845_587.jpg \n\nAlso, my main aim of going there was to share some writing materials with the students so I went some packs of pen to share with them, I saw how excited these children were immediately I made mention of it, and my second motives of going there was  to inform some staff about the existence of an amazing platform called #Hive Blockchain, I've shared with #holoozing community when I took Holozing creatures in printed materials to Begotten International Schools, creating awareness of the amazing Holozing Games, so this is another school I went in promoting hive blockchain. The response I got the school management is what tricker my heart to make this post. \n https://img.inleo.io/DQmRTotPU4zvhew7s7Krp7Td3gPDcyVQPAHjBj54RxhRYcg/IMG_20240715_111105_214.jpg \n\nIndeed, there are many who are yet to know about Hive Blockchain, in my little moment at the school, I saw their readiness to be onboarded, truly no work of love can go unrewarded, the photographs shows the level of the excitement as I was sharing out the pens to the students in their the class. \n\nAlso, you can be a part of this project on #Hive Reachout community as I  invited @edbass, @fonpet, and @emwin for their input. Thank you for visiting my blog, I'm @inibless, your friend!\n\n  \n\n\nPosted Using [InLeo Alpha](https://inleo.io/@inibless/hive-reachout-putting-smiling-on-children-faces-by-giving-writing-materials-fed)"
  },
  {
    "author": "hive-reachout",
    "permlink": "hivereachout-communityhive-for-humanity-inleo-initiative4-5fx",
    "body": "#### Hive-Reachout Community>>\"Hive For Humanity\" (InLeo Initiative4)\n\n![vd315q.jpg](https://files.peakd.com/file/peakd-hive/hive-reachout/23xypFbYDuK71qncBL8xV2nu1MG2Lz4pqGhF6vQuq2xCLSsagK4HnxCAYoxfjTpN1ky4F.jpg)\n\n\n____ \n## <center>**WELCOME TO HIVE-REACHOUT COMMUNITY**</center> \n\n<center><sub>***A community open to advertise and promote Hive Blockchain through sharing love and support to humanity..***</sub></center>\n____ \n\n\n\n\n**Do well to subscribe to our community as we put heads together to promote humanity and love..**\n\n\n![5wn4VDmRceY4POFaqi.gif](https://files.peakd.com/file/peakd-hive/ovey10/23ydCbjvpv4mP45XPQwEU1T6WViV8sSnAzVQ5uypviUyqkLEP5dZqmv4TUcPnd745UYXq.gif)\n\n\n\n<center><sub>**[Click here to be re-directed to Hive Reachout Community](https://InLeo.io/c/hive-178437)**</sub></center>\n\n____\n### <center>**Hive For Humanity (How Hive and web3 has impacted and still impacting the general society**</center>\n____\n\nhttps://img.inleo.io/DQmZi13vMN1s6fWfGf8CvPPHG9vnhB3wXJC3FT3TasuBicc/Copy%20of%20Copy%20of%20Copy%20of%20Week%2032_20240715_114558_0000.png \n\n<div class=\"text-justify\"> \n\nWe are pleased to announce our recent Collab with the InLeo team to promote knowledge of Hive and the InLeo user interphase amongst our community members.\n\nWe will be teaching members of the community about InLeo frontend and possibly engage them in activities that will improve their knowledge about Hive and InLeo as part of the Hive Reachout collaboration with InLeo.\n\nThis week, the Hive Reachout and her community members will be talking about <h5>**\"Hive For Humanity\".**</h5> community members are to explore how Hive Blockchain and web3 has impacted the general society and still impacting our localities.\n\nIt is our desire to provide a conducive environment of learning to all the newbies we are onboarding, and all other newbie on Hive. \n\nThe Hive Reachout and InLeo initiative will help newbies and other community members to learn more about InLeo frontend and other necessary factors about InLeo.</div>\n\n\n\n<div class=\"text-justify\"> \n\nhttps://img.inleo.io/DQmUyK3kcxxQpPHJcwLgoy8f9P2gHeZHRnnnY81BdJ37Kob/IMG-20240611-WA0033.jpg\n\n\n____\n### <center>**How To Login Your Hive Account Via InLeo Frontend**</center>\n____\n\n\nInLeo is a micro-blogging space set up by @leofinance community on Hive Blockchain, where you can make threads and publish your posts. You earn both in Hive and $Leo (A native token of the community) in the process.\n\ni. Click on the cite link <a href='InLeo.io'>InLeo.io</a>\n\nhttps://img.inleo.io/DQmNuJ1G1qMP2PmsEn2TjGM23RJHz6YKRacnty4uAXm8TYZ/Screenshot_20240610-150717.jpg\n\nii. You can sign in with X (Twitter) only if you registered your hive account using your Twitter X via the InLeo frontend or You may choose to sign in through your google account if you did register using your google account.\n\niii. The most common way of signing in for users that registered their Hive accounts via other frontends other than InLeo is through LeoAuth, Hivesigner and Hive Keychain.\n\nYou may choose to sign in via LeoAuth. with your Hive username and your Hive private key (The keys assigned to you when you registered your account).\n\niv. You can sign in with your Hive Keychain. \n\nhttps://img.inleo.io/DQmcB8NDYp93AM1xTyL1BAUVcB42VE8oK4QJut3qhD4HfAL/Screenshot_20240610-185637.jpg\n\nThis method is best used when you have your Hive keychain app installed in your mobile device if not,\n\n\nvi. You can use the hive signer method to login InLeo with just your username and your private key.\n\nhttps://img.inleo.io/DQmdZ2DuFru8ZHNDENUUmJ1tgaVaTQW4aDhxdTcLi3S2Mph/IMG-20240610-WA0019.jpg\n\n**If you can see your profile icon like this, it means you have successfully logged into InLeo**\n\n____\n### <center>**How To Publish Post/Threads Via InLeo Frontend..**</center>\n____\n\n\nhttps://img.inleo.io/DQmfTDuHqkPs4yXG5cLkfhCEHsHhQXrngCReadgPd68iW9p/IMG-20240611-WA0021.jpg\n\ni. Click on the pencil icon on the left side of your screen indicated with an arrow and select 'create a post'\n\nNote: For those using mobile the pencil icon is by the right below your screen.\n\n \nhttps://img.inleo.io/DQmTCKXKDZSLkkMguBewNQkASDCbmoNkJ7H9C3ZkurPHpvL/IMG-20240611-WA0031.jpg\n\nii. The \"Create a Post\" interphase on InLeo will appear like the one above..\n\nThe number 1 is the box to input the Title of your post while number 2 is for the body of your post or article.\n\nThe green arrow is pointing at the gallery icon where you can input your desired image..\n\nhttps://img.inleo.io/DQmYU71ATpMPFPU1gYE5Fea224c9sy5ysayXT7cWVfvW2oD/IMG-20240611-WA0029.jpg\n \niii. After preparing your post and inserting your desired pictures or thumbnail, you can use the number one section (Select Community) on the image above to choose the preferred community you want to publish your post in. \n\n*since this program is for the InLeo Collab with Hive Reachout community, all post should be made into the **Hive Reachout community**..\n\n\niv. The tag box indicated as number 2 is meant to input the keywords or how you label your post.\n\n*For this initiative, we shall be using; hive-reachout, love, inleo and any other preferred tags..*\n\n*Note: Press your enter key after each tag on InLeo, so that your tags can count separately...*\n\nhttps://img.inleo.io/DQmPuAXuxjvLQJBB4g6kgd16D3DZnmFwRwfHEVRkeqrpBoK/IMG-20240611-WA0030.jpg\n\nv. For newbies, we advice to live the reward at 50% Hive power and 50% HBD but you can go ahead to change it if you wish.\n\n- You can allocate portion of your rewards to another account via the beneficiary side and you can as well neglect it if you want to claim all rewards of your post outcome..\n- Scheduling your post means your post will not be published immediately until the desired time you will choose in the post schedule side.. If you don't want to reschedule your post for another time before publishing, neglect the post scheduling and move straight to Publish your post..\n- The arrow on the image above is pointing at the publish icon, you can click on it when you are done and ready to take up your post..\n\n### **Rules For This Initiative**\n-  **DON'T PLAGIARIZE!!**\n- Create your posts in the Hive Reachout community.\n- Tag two or three person to join the hive-reachout/InLeo Collab.\n- Use the tag #hive-reachout #love and any other tags of your choice..\n- Engage in (at least) two posts in the community: \n- Your words count should be minimum of 500 words..\n- Original pictures are \"encouraged\", however if you want to use pictures that are not yours, use free sites like <a href='https://pixabay.com/'>pixabay.com</a>, <a href='https://www.pexels.com/'>pexels.com</a>\n- Cite external materials properly.\n- Drop your InLeo post link in the comment section below...\n\n\n**We will be tagging our newbies in the comment section below and should incase you find this article important to someone probably a newbie, endeavor to tag them in the comment section..\nWe hope to ease the work for onboarders on Hive Blockchain..**\n\n\n____\n\n## <center>**YOU CAN REACH US VIA OUR SOCIAL MEDIA HANDLES**</center>\n____\n\nWe are set to reach large number of audiences in this mission via the following handles: </div>\n\n![FUkUE5bzkAZT3HzV5tJDiU2ik81PCd4JCyhWnRcDN8XJsVFY3UNB8DCZkTaR7u9FShbSRL9TgeKjSyg6jEUohbdFwqoRvbDF5M3eoVV338ALkLbp3Yb1NyVbn6FwDnYiU84aC9ecQPwsywChghPJ3woAHGnAeZAUyNq4.png](https://files.peakd.com/file/peakd-hive/ovey10/23zbgTz1A24uGRLzYf64hB2moefM6sMuJKL8zvEwa2wmaZzvspydzg4rmzUjgpcfwNSqg.png)\n\n* You can connect with us on Twitter(X) via:\n**<a href='https://twitter.com/Hive_Reachout?t=Fidz77sEcdHQ-_dbgpLxSw&s=09'>@Hive_Reachout On Twitter X</a>**\n\n* You can connect us on Instagram via:\n**<a href='https://www.instagram.com/hive_reachout?igsh=OGQ5ZDc2ODk2ZA=='>@Hive_Reachout On Instagram</a>**\n\n* Reach us via our email address\n**Hivereachout@gmail.com**\n\n* Or  <a href='https://discord.com/invite/N2Pj9Ekccu'>Via Discord</a>\n\n#### Endeavor to subscribe and give us a follow..\n\n<div class=\"text-justify\"> \n\n\n## <center>***APPRECIATION***</center>\n\n____\n\nWe are indeed grateful to everyone, contributing through words, encouragement and donations to push this community forward. The Hive-reachout team are saying a big thank you 🙏🙏\n\n\n\n____\n\n\n<center>***Let's Spread love, calmness, and smiles on people's faces by reaching out to them...***</center>\n\n\n![1706797841882 (2).png](https://files.peakd.com/file/peakd-hive/ovey10/23xVcQWuGkHjf5GDdmV7iQSNFbkiwVnk8m7Vzuan5USHEuE7YQChSgyhbr2GqreKGQXxm.png)\n\n\n____\n### <center>**If you love this project do well to comment, reblog, upvote,  tag one or two friends and support us in any way that you can🙏🙏**</center>\n____\n\n\n![BackgroundEraser_20240201_123513386 (1).png](https://files.peakd.com/file/peakd-hive/ovey10/23uFKWrJGynFvorYadCQhBgC9A29D8CyGi7wd8fsDepwx1FWnx6cZWSFhPHUB79rFAYuk.png)\n\n</div>\n\n\n**Post Written by @ovey10**\n\n\n\nPosted Using [InLeo Alpha](https://inleo.io/@hive-reachout/hivereachout-communityhive-for-humanity-inleo-initiative4-5fx)"
  },
  {
    "author": "fasacity",
    "permlink": "the-power-of-living-with-neighbor-in-harmony--ddw",
    "body": "<div class'text-justify'>\n\n https://img.inleo.io/DQmRXoXGM1JnC3k77n6zovxuFyZZLNyTNqDpivp8v3GSUkA/photo-1603481502177-c0a256d1efef.jpeg \n\n[Source](https://unsplash.com/photos/a-large-sign-on-the-side-of-a-building-that-says-love-your-neighbor-W8kl19hCryA)\n\nLife is programmed in such a way that staying in isolation will spark more challenges and if not properly managed could lead to death. Human beings are a special specie of God's creation whose system of lifestyle is interdependent.\n\nThe theme for this inleo initiative 3 speaks about etiquette for harmonious living with a neighbor. This is very critical and the need for the present time looking at the trending things in the globe today. What we see now wasn't so in the beginning. The story told by my parents during their days comparing with what I see now, there is a variance and vacuum that need to be filled. People before hardly live in isolation unlike now that is almost becoming a general acceptable thing.\nLet me draw some input on the key subject matter.\n### who is a neighbor?\nThis question may be simple and difficult to answer depending on the side of the coin however in my opinion it should be a common ground of thought. A neighbor is anyone that lives close to you. A neighbor is a person near or lives very close to you in spite there background, or other appellations. Neighbor has nothing to do with with your tribe, religion or social status. Any individual that lives near where you are is said to be a neighbor. When I was growing up, my mindset was that a neighbor must be like a friend or a family that is known and we share things I'm common not minding the distance. There's a paradigm shift with the present development in knowledge. A neighbor worth more than a gold and a brother as far as I am concerned. A neighbor is even closer than the family members because of proximity. \n\n https://img.inleo.io/DQmRM1PgF7wCP4DuEXpTrF8y8pwFpyyPDbBR6bGuPPALkAW/photo-1546641082-cc6e696dacdb.jpeg \n\n[Source](https://unsplash.com/photos/brown-wooden-board-with-hello-neighbor-come-on-in-signage-0rd-uBuds-g)\n\nI remembered there is a young family man that lives in my uncle's boys quarters. When he was bedridden, it was his neighbor that stood out all through even when he dropped his last breath in the hospital. This is truly a definition of a neighbor without missing any word.\n### what's etiquette?\nEtiquette simply means the rules or guidelines that controls a particular behavior. It could also means customs that directs one on what to do per time.\n### The power of living in harmony with neighbor.\nIt's a great thing when we live in harmony and peace with our neighbors I think at all cost. I would share some tips that could help one live in harmony with neighbor and what are those things to avoid which could have a negative impact.\nSome of the dos are;\n* Be friendly. Learn to be friendly to your neighbor. Show them love, care and concern. Presently I have a neighbor in my compound even though we weren't the same tribe, religion etc yet I relate with him as a friend. He so excited when ever he sees me and hardly does he get angry on time.\n* Be helpful. Be sacrificial and respond to any need that you capacity to handle.\n* Behave maturely. It's not everything that you must respond to for the sake of peace and harmonious living.\n* Maintain your integrity and trustworthy nature.  Have respect for each other's opinion. Don't be biased.\n* Endeavor to maintain some level of neatness and decorum. \nSome of the dont are;\n* Avoid unnecessary noise and arguments. Always give allowance to tolerate each other.\n\nIt might not be easy but it's achievable to live together with a neighbor. We need one another all other Incase of any challenge. You might be up today and tomorrow you might be down. Your neighbor might be there to help out.\n\n</div>\n\nPosted Using [InLeo Alpha](https://inleo.io/@fasacity/the-power-of-living-with-neighbor-in-harmony--ddw)"
  },
  {
    "author": "rubenstorm",
    "permlink": "update-on-a-day-of-hope-journey-to-the-orphan-children-in-the-shadow-of-kilimanjaro",
    "body": "**Seven months ago, I published an article titled »A Day of Hope: Journey to the Orphan Children in the Shadow of Kilimanjaro«.** Unfortunately, the link I included for the organization wasn't quite right – it didn't lead you to the information you needed.\n\n![001.jpg](https://images.hive.blog/DQmXZhSvrurfLmzcaopH5KDurnGbGX7mAkopykaZfuSfHNt/001.jpg)\n\n**I'm happy to report that I recently reconnected with someone from the organization during my return trip to Moshi!** They've informed me that their website is now up and running smoothly at a new address.\n\n**While I wasn't able to visit the children again this time, I wanted to provide the correct website address in this update.** For anyone interested in donating or volunteering, you'll now find all the necessary details on their official website: [worthyofhopetanzania.com](https://worthyofhopetanzania.com/) \n\n**I sincerely apologize for the inconvenience caused by the incorrect link in my original post.** I hope this update empowers you to learn more about the organization and their important work.\n\n**The photo you see here is from my December 2023 visit, included in the original article.**\n\n**Finally, a big thank you to @achimmertens for promoting the original post!**\n\n**Please share this update to spread the word and help this fantastic organization continue its mission.**\n\nCheck out this article for details about my visit in December 2023 @ rubenstorm/a-day-of-hope-journey\n\n### **Find me on Nostr**\n\n[npub1kt92nvl0xra26cz7tmhd3k3v3ltmfj5890kdc3qq9860h84tp76swuf0p0](https://primal.net/p/npub1kt92nvl0xra26cz7tmhd3k3v3ltmfj5890kdc3qq9860h84tp76swuf0p0)\n\n### **Online**\n\n[Profile Page](https://rubenstorm.de.cool/) | [Support Page](https://rubenstorm.12hp.de/)\n\nFeel free to support me by sending some sats via the lightning network to rubenstorm@sats.mobi \n\n![rubenstorm@sats.mobi.jpeg](https://images.hive.blog/DQmRnmpEbq9xu28sEYB15EGTszEWMK8AoRAWvCiVLabuKsE/rubenstorm@sats.mobi.jpeg)"
  },
  {
    "author": "d-a-d",
    "permlink": "akpnyhcf",
    "body": "<center>\n\n[![](https://ipfs-3speak.b-cdn.net/ipfs/bafybeihciyxiyzh5undzkh3figzfv5txaqclcwdatrgc2j6opxnay2oi3q/)](https://3speak.tv/watch?v=d-a-d/akpnyhcf)\n\n▶️ [Watch on 3Speak](https://3speak.tv/watch?v=d-a-d/akpnyhcf)\n\n</center>\n\n---\n\nAs I continue preparing for the upcoming awareness/fund raising event, I've been completing early morning walks in the hope that I'll be conditioned enough to finish the 79 kilometres. While I've alwaye been adamant that I'll get through the distance, yesterday, I came to an explosive🤯 realisation.\n\n---\n\n▶️ [3Speak](https://3speak.tv/watch?v=d-a-d/akpnyhcf)\n"
  },
  {
    "author": "adaezeinchrist",
    "permlink": "ylblaxmx",
    "body": "<center>\n\n[![](https://ipfs-3speak.b-cdn.net/ipfs/bafybeigul77jpgs5ao5g6fq5x6ko54yl675jx5dmyqzotaumeck5qnr33u/)](https://3speak.tv/watch?v=adaezeinchrist/ylblaxmx)\n\n▶️ [Watch on 3Speak](https://3speak.tv/watch?v=adaezeinchrist/ylblaxmx)\n\n</center>\n\n---\n\n![](https://images.ecency.com/DQmQdQBusWNfhru7V6aCidXUF5Ehe7onwXhQ8DKxCSqnJPX/black_gold_elegant_happy_birthday_instagram_post_20240711_143715_0000.png)\r\n\r\n\r\nIs so good to be back for this week throw back. I love it so much when we tell great stories that can motivate people positively.\r\n\r\n\r\n![](https://images.ecency.com/DQmPzdE1k7vBSpdMy8PDKfDNvDgB6KgKLux9tXcRUXvtBuh/img_20221125_100949_915.jpg)\r\n\r\n![](https://images.ecency.com/DQmSnw6mK134UtUkCjSxxQQ4AFzrudFUN1q4ccURpA4jgoV/img_20221125_101214_893.jpg)\r\n\r\n![](https://images.ecency.com/DQmYKi9RWvfUxaq3YMZJ5WMEMVfpme3WjWRemMmMEC6FLhG/img_20221125_100858_737.jpg)\r\n\r\n\r\nGood to have you too. I will be sharing a story of how we visited a primary school when I joined #HIVE newly with my onboarder @hivedeb and @fasacity. With the help of many others we went to the school to help to pay the school fees of kids that their parents can't afford it. Uniforms was also given to them together with note books with hive logo on it. \r\n\r\n\r\n![](https://images.ecency.com/DQmYZzF6bwC3jPNuVwXQLmAdkERt3ip1zDHpfpdapiFjFdx/img_20221125_093542_443.jpg)\r\n\r\n![](https://images.ecency.com/DQmWdhmRtvD9E8vVx5f1Dci7TKkdiZA5rjDRmEyQEe94Rsq/img_20221125_093538_523.jpg)\r\n\r\n![](https://images.ecency.com/DQmZBZW9YzL8Uij6e3NWEija4bgxaaBuxUDxaeuEj22c1Da/img_20221125_093630_022.jpg)\r\n\r\nIt was a wonderful experience for me and it taught me to lend a helping hands to others even when I don't have enough for myself. \r\n\r\nThis will be all for today. Do stay bless and I will love to read your stories too in this community.\r\nThanks for coming around.\r\n\r\n\r\nThe link to the background sound.\r\n\r\nhttps://stocktune.com/free-music/playground-beats-battle-18510-32271\r\n\r\nSome of the pictures belongs to me and some belongs to @hivedeb who initiated the journey.\n\n---\n\n▶️ [3Speak](https://3speak.tv/watch?v=adaezeinchrist/ylblaxmx)\n"
  },
  {
    "author": "elkezaksek",
    "permlink": "news-about-our-fundraiser-for-uganda-neuigkeiten-unserer-spendenaktion-fuer-uganda-222",
    "body": "❤️❤️❤️ Let's move on !!!\nThe house is making great progress.\n\n\nWe would like to thank everyone here on the blockchain who is supporting us.\n\nTHANK YOU! ❤️❤️❤️THANK YOU!❤️❤️❤️  THANK YOU!\n\n\n![27.jpg](https://images.hive.blog/DQmSECxroD3twNEfaoymAjJnfqwgXzCnD59xdECWTCC1rEL/27.jpg)\n\n![31.jpg](https://images.hive.blog/DQmR45JLBgfwAaqgfZ82PJr5mjNZBJSd5ys6jd6tVQgpDwb/31.jpg)\n\n![32.jpg](https://images.hive.blog/DQmS4xCPnufJyJkhb1qLfzGcA5SuX2JSJ9DbbJSJGZHjaWT/32.jpg)\n\n![28.jpg](https://images.hive.blog/DQmP5SVRseX5B4WXwzFrF3iKuiZcpLX8azCsAocTogDYKb9/28.jpg)\n\n![29.jpg](https://images.hive.blog/DQmYXmAdpyi58JnTkBENbjRe5SC5mZUAZLrqCFcnXATDkFR/29.jpg)\n\n![30.jpg](https://images.hive.blog/DQmeJ3csLmy7KPVCxWgGoZv82yHvNW9F2qA1QBCXrcGDVbi/30.jpg)\n\n\n❤️❤️❤️Weiter geht's !!\nDas Haus macht große Fortschritte.\n\n\nWir möchten uns ganz herzlich bei allen hier in der Blockchain bedanken, die uns unterstützen.\n\nDANKE! ❤️❤️❤️ DANKE!  ❤️❤️❤️DANKE!\n\nhttps://hive.blog/hive-150329/@elkezaksek/the-story-of-our-uganda-project"
  },
  {
    "author": "d-a-d",
    "permlink": "you-cant-stop",
    "body": "It’s been some time since my last post where I outlined my plans to run an awareness raiser so that more people can learn about Duchenne muscular dystrophy (DMD). Since that post, I’ve been busy getting some of the ideas around the awareness raiser into action and trying to walk as often as possible so that I can be somewhat ready for the walk.\n\nI’m currently on school holidays (one of the perks of being a teacher), which has allowed me to get some decent-sized walks in each day. I’ve been getting up at 5am and have found a nice 12km loop that I’m able to complete in about 2 hours.\n\nThe past couple of days has been almost freezing. This morning, however, was not so cold, but it was raining and windy. I could hear the maelstrom from my bed as I was waking up and was tempted, only for a fraction of a second, mind you, to remain where I was. It was warm. Outside wasn’t. But I’ve found that my body really enjoys these early morning walks, so I got up and wrapped myself up in a few layers before putting on a newly purchased water-proof jacket.\n\n<center>\n![IMG_2338.jpeg](https://files.peakd.com/file/peakd-hive/d-a-d/23zRvzywuY14r3xXxpiv2ftkd6PPCtvFkD6PHViFEmDKKEVaQXtWLQhNVTtn5mqeck583.jpeg)\n<sub>Despite being a horrible morning for a walk it was psychologically fulfilling.</sub>\n</center>\n\nI wouldn’t have been 20 minutes into the walk when the rain picked up to a steady downpour and while the water-proof jacket was holding up well, my shoes were getting a good drenching and I could feel the water seeping through my socks. At this point, I reckon I should have been at my lowest. It was wet, windy and cold, and my bottom half was getting a thorough soaking. My mind did start to consider the option of turning around and heading home to see if the weather would clear up in due course, but these thoughts only lasted for a few seconds before a much clearer, much stronger one demanded of me:\n\nYou Can’t Stop.\n\nUnpacking this over the next couple of minutes, I came to the realisation that this walk I’m going to be doing in September will be difficult - I purposely designed it to be. But in that moment as the rain was peppering me, I realised that people with DMD, my son included, can’t just go home when they feel like it. They can’t just pack up their wheelchairs for a day because they don’t feel like using them in that moment, so who am I to think about quitting when the weather isn’t what I expect it to be? How could I even contemplate stopping?\n\nIt cemented in my mind that this walk is going to happen. I’m not going to stop until I’ve finished it. I can’t. The infantry corps in the Australian Army have a creed, or a mandate, or something. Part of it goes: ‘… to seize and hold ground regardless of season, weather or terrain.’ I will complete this walk regardless of ‘season, weather or strain’.\n\n(As an aside, despite, or perhaps it was because of, the weather, I was able to walk some of the fastest kilometres I’ve done so far.  \n \n\n\n![------------------------------------------------------------------------ @d-a-d ---------------------------------------------------------------.png](https://files.peakd.com/file/peakd-hive/d-a-d/23swnJVUs7HKZ6Huu8v8YTQjdMza7VHo4JBMXwBnDxsF2JVa7sMT19ceJBtzWYu3ZjPDR.png)\n\n\n\n<hr>\n\n![Join us on.png](https://files.peakd.com/file/peakd-hive/d-a-d/241tVAY4U2bz3rrK91M6YdV5oJQ6NT5oNjioHxuZiywqpc4SVNJAWzoxg4iFXY9XqkWcw.png)\n\n\n\n\n\n\n"
  },
  {
    "author": "storygoddess",
    "permlink": "unconditional-love-beyond-family--aqe",
    "body": "  \n\nhttps://img.inleo.io/DQmUxKDmQma9efH68wL2UcCmFHxPypqSPeaKEicZHKVsZgH/IMG_20240710_235406.jpg\n\n<div class=\"text-justify\">I was laying there, almost lifeless. It finally got worse. The ailment I had been hiding for about three weeks because I hate to ask for help. I always wished and preferred that someone reads my mind, or better still get some form of miracles without saying anything to anyone. I knew the ailment was going to get worse but for financial incapacity, I couldn't get the required medical care, so I hoped for some form of miracle to happen. \n\n\nThe miracle did come one day after I finished writing a test, and I found it hard to lift a limb. At that point, my friends suspected something was up with me and I was asked questions, however, I was even struggling to breathe talk more answer their questions. Straight away, one of them walked me to his car, another one entered the car with me, while some two others also insisted they would follow us to the hospital. \n\n\nRight at the hospital, everything got complicated, and my friends ran helter skelter, calling the doctors, nurses, and anyone they could call to save my life. I was there in one shock that I didn't understand. I couldn't control the happenings within my body, but my mind was active to feel the presence of my friends around me. \n***\n  \nhttps://img.inleo.io/DQmQvgRuewDVZna5YwhjnCQPaztFRQV5ZNpuR7FwJL9wThe/IMG-20240710-WA0015.jpg\n\nUnconditional love? I've experienced it with my parents, my siblings, and my extended family members, however, I didn't believe that I could get such in-depth love elsewhere. Well, I did experienced it with my friends. \n\nOn the sick bed, I could hear the doctor calling the amounts of money needed to begin treatment in thousands, and I knew I didn't even have half of it in my account. My parents number was known by nobody, so, I was close to hopeless. But my friends stood strong for me. I heard one of them ask the doctor how much it would cost and he immediately made the transfer. Only two people were allowed to stay with me while they administer treatment and the others that were outside couldn't stop asking for updates. \n\nWhat's unconditional love? The friendship I shared with my friends  was never conditional, neither was it transactional. My friends did all that and more until my parents came to finally take me home. I was helpless. I couldn't even say I want to pay them back because how am I supposed to even do that? Thinking of paying them back actually is a burden on me because my friends would reject all forms of ways to return their favours. When I returned to school, and went back to appreciate my friends, one of them said to me \"you are my friend, and that's one thing I should be able to do for whoever I call a friend\". \n\n***\nThere was a small community where I met with parents of some high school kids whose parents didn't believe in education to speak to them to support their kids goals. I remember successfully convincing parents of two of those kids to send them to tertiary institutions of their choice. There was a time I used to receive calls from these kids. Why? They wanted to appreciate my efforts in making sure their life didn't end in high school. They could've either gotten married after high school, or join their mother's business of harvesting fresh milk from their father's cattle farm. Why did I do it? I love those children, and their future is more important to me than anything. So, I did my part, and moved on to the next person. Isn't that what unconditional love is? \n\nShowing love to the people around you, be it family or not, and expecting nothing in return is what unconditional love means. Unconditional love, and non-transactional love is the best form of love one can receive.</div> \n\nFirst image was generated on MetaAi and the second image is mine. \n\nThis is my entry to #Julyinleo prompts. \n\nPosted Using [InLeo Alpha](https://inleo.io/@storygoddess/unconditional-love-beyond-family--aqe)"
  },
  {
    "author": "somuchgrace",
    "permlink": "tips-for-a-peaceful-coexistence--g14",
    "body": "Hello everyone, I hope you are doing very well today and that your day is going very well too.\n https://img.inleo.io/DQmeSBPW53s9FWAhE75bhn2F88p78jeivNDCJhiDbz4QNGS/figures-1929874_1280.webp \n\n[Image](https://pixabay.com/illustrations/characters-people-silhouettes-peace-1929874/)\n\n\n\nHarmonious living is being where others coexist in a peaceful and balanced manner without having to disrespect any other person.\n\nNobody can stay alone in this world, so for you to stay with other people, you need to learn harmonious living.\n\nMutual respect must exist if people are to coexist. They have to learn how to respect others' opinions.\n\nTo respect another person or stay with them in peace, one has to be at peace with himself.\n\n\n\n\nHere are some of the ways you can practice harmonious living in society:\n\n\n\n\nEmpathy and Understanding: To coexist with others, you need to put your legs in their shoes and make sure that you treat them the way you would want them to treat you too.\n\nIf you want people to understand you, then you also need to understand them.\n\n\n\n\nRespect Diversity: You need to respect other people's opinions, cultural beliefs, race, and religion and embrace them too.\n\nYou don't have to make them feel worse or probably want to convince them to do things the way you do. Make them feel better and more welcomed; do not scare people away.\n\nAnother is that you should always accept people for their character and correct them with love so as not to push them away.\n\n\n\n\nCommunication: If you want to coexist with people in a harmonious way, you need to listen well, speak clearly, and also act respectfully.\n\nNobody likes feeling bad, so do not make other people feel bad because of how you act, talk, or don't listen to them.\n\n\n\n\nHave an Open Mind: Be ready to embrace new ideas, new beliefs, new perspectives, etc.\n\nYou never know if those new things are correct or not, but if you just want to be correct at all times, people may not really like you, and you may not also live in peace with them.\n\n\n\n\nBe Kind: If you want to be liked, then like other people. No one will like a person who doesn't like other people. Show some kindness to people, help them, and make them happy.\n\n\n\n\nForgive: I would always say to forgive in advance, and in doing this, you need to know that people will hurt you mistakenly or purposefully, but in all, learn how to forgive people.\n\n\n\n\nGratefulness: Learn how to appreciate people for what they do for you.\n\nNo matter how small the favor is, let them know how special that favor is to you.\n\n\n\n\nDo not engage in violence. There are people that cannot stay without fighting, and if there is a fight going on somewhere, they will have to be there to make sure that they make the fight worse.\n\nAlways learn to be responsible and accountable for something; don't say \"I don't know\" to every question that you are asked, because it will show that you are not responsible at all.\n\nDon't gossip or talk down on anyone who has made a mistake; try to encourage people and help them stand up and not fall.\n\n\n\n\nPosted Using [InLeo Alpha](https://inleo.io/@somuchgrace/tips-for-a-peaceful-coexistence--g14)"
  }
]